app/Controllers/AttendanceController.php

    public function studentAttendance()
    {
        // Fetch student attendance data
        $attendanceModel = new StudentAttendanceModel();
        $attendanceData = $attendanceModel->findAll();

        // Replace foreign key IDs with corresponding names
        foreach ($attendanceData as &$attendance) {

            // Fetch student name
            $studentModel = new StudentModel();
            $student = $studentModel->find($attendance['student']);
            $attendance['student'] = $student['firstname'] . ' ' . $student['lastname'];

            $sectionModel = new SectionModel();
            $section = $sectionModel->find($student['section']);
---
SELECT *
FROM `student_attendance`
SELECT *
FROM `students`
WHERE `students`.`id` = '45'
SELECT *
FROM `sections`
WHERE `sections`.`id` = '21'