app/Controllers/ChatController.php

SELECT DISTINCT `sender`, `receiver`
FROM `chat_messages`
WHERE `sender` = '7'
OR `receiver` = '7'
SELECT *
FROM `account`
WHERE `account`.`id` IN ('5','12')
---
    public function getConnectedUsers()
    {
        try {
            // Get the currently logged-in user ID
            $loggedUserId = $this->getUserIdFromToken();

            if (!$loggedUserId) {
                return $this->failUnauthorized('Invalid token or user not logged in.');
            }

            // Fetch connected users from the database (adjust the logic based on your requirements)
            $connectedUsers = $this->messageModel
                ->distinct()
                ->select('sender, receiver')
                ->where('sender', $loggedUserId)
                ->orWhere('receiver', $loggedUserId)
                ->findAll();

            // Merge sender and receiver IDs, then remove the current user's ID
            $userIds = array_merge(array_column($connectedUsers, 'sender'), array_column($connectedUsers, 'receiver'));
            $userIds = array_diff($userIds, [$loggedUserId]);

            // Fetch unique user IDs
            $uniqueUserIds = array_unique($userIds);

            // Fetch user details from the account table based on unique user IDs
            $uniqueUsers = $this->accountModel->find($uniqueUserIds);

SELECT *
FROM `chat_messages`
WHERE `receiver` = '7'
AND `sender` = '5'
OR `receiver` = '5'
ORDER BY `id` DESC
 LIMIT 1
---
            $responseData = [];
            foreach ($uniqueUsers as $user) {
                // Get the latest message for the current user as either sender or receiver
                $latestMessage = $this->messageModel
                    ->where('receiver', $loggedUserId)
                    ->where('sender', $user['id'])
                    ->orWhere('receiver', $user['id'])
                    ->orderBy('id', 'desc')
                    ->first();

SELECT *
FROM `chat_messages`
WHERE `sender` IN ('19','20')
AND `receiver` IN ('19','20')
ORDER BY `created_at` ASC
SELECT *
FROM `account`
WHERE `account`.`id` = '19'
SELECT *
FROM `account`
WHERE `account`.`id` = '20'
---
    public function getUserMessages($userId)
    {
        try {
            // Get the currently logged-in user ID
            $loggedUserId = $this->getUserIdFromToken();

            if (!$loggedUserId) {
                return $this->failUnauthorized('Invalid token or user not logged in.');
            }

            // Fetch messages from the database where the user is either sender or receiver
            $messages = $this->messageModel
                ->whereIn('sender', [$loggedUserId, $userId])
                ->whereIn('receiver', [$loggedUserId, $userId])
                ->orderBy('created_at', 'asc')
                ->findAll();

            // Fetch sender and receiver names from the account table
            foreach ($messages as &$message) {
                $sender = $this->accountModel->find($message['sender']);
                $receiver = $this->accountModel->find($message['receiver']);