app/Controllers/CoachController.php

    public function getData()
    {
        $student = new CoachModel();
        $data = $student->findAll();
---
SELECT *
FROM `coaches`

    public function deleteData($id = null)
    {
        $coachModel = new CoachModel();
        $r = $coachModel->delete($id); // Assuming your primary key field is 'id'
---
DELETE FROM `coaches`
WHERE `id` IN ('13')