app/Controllers/EventController.php

    public function getData()
    {
        $events = new EventModel();
        $data = $events->findAll();
---
SELECT *
FROM `events`