app/Controllers/SectionController.php

SELECT *
FROM `sections`
---
    public function getData()
    {
        $sections = new SectionModel();
        $data = $sections->findAll();