app/Controllers/StudentController.php

    public function getData()
    {
        $studentModel = new StudentModel();
        $students = $studentModel->findAll();

        // Replace foreign key IDs with corresponding names
        foreach ($students as &$student) {
            // Fetch section name if it exists
            if (!empty($student['section'])) {
                $sectionModel = new SectionModel();
                $section = $sectionModel->find($student['section']);
                // Update the 'section' field only if the section is found
                if ($section) {
                    $student['section'] = $section['name'];
                }
            }
            else{
                $student['section'] = "Not assigned";
            }

            // Fetch coach name
            // $coachModel = new CoachModel();
            // $coach = $coachModel->find($student['coach']);
            // $student['coach'] = $coach['firstname'] . ' ' . $coach['lastname'];

            // Fetch parent/guardian name
            $parentsModel = new ParentsModel();
            $parent = $parentsModel->find($student['parent_guardian']);
---
SELECT *
FROM `students`
SELECT *
FROM `sections`
WHERE `sections`.`id` = '21'
SELECT *
FROM `parents`
WHERE `parents`.`id` = '2'